questions = {
    1: "Текстовый файл (скачай по ссылке: https://kpolyakov.spb.ru/cms/files/ege-sym/24-3.txt) состоит не более чем из 10^6 английских больших и маленьких букв, а также цифр. Сколько раз встречаются в файле цифры?",
    2: "Текстовый файл (скачай по ссылке: https://kpolyakov.spb.ru/cms/files/ege-sym/24-3.txt) состоит не более чем из 10^6 английских больших и маленьких букв. Определите общее количество символов в строке?",
    3: "Текстовый файл (скачай по ссылке: https://kpolyakov.spb.ru/cms/files/ege-sym/24-3.txt) состоит не более чем из 10^6 английских больших и маленьких букв. Определите индекс последней буквы T.",
    4: "Текстовый файл (скачай по ссылке: https://kpolyakov.spb.ru/cms/files/ege-sym/24-3.txt) состоит не более чем из 10^6 английских больших и маленьких букв. Сколько символов останется в файле, если убрать все сочетания 'sx' и цифру 0?",
    5: "Текстовый файл (скачай по ссылке: https://kpolyakov.spb.ru/cms/files/ege-sym/24-3.txt) состоит не более чем из 10^6 английских больших и маленьких букв. Сколько всего букв 'x'?",
    6: "Текстовый файл (скачай по ссылке: https://kpolyakov.spb.ru/cms/files/ege-sym/24-j5.txt) состоит не более чем из 106 символов S, T, O, C, K. Сколько раз встречается комбинация «OCK», не являющаяся при этом частью комбинации «STOCK».",
    7: "Текстовый файл (скачай по ссылке: https://kpolyakov.spb.ru/cms/files/ege-sym/24-j5.txt) состоит не более чем из 106 символов S, T, O, C, K. Создай программу, которая разделяется строку по буквам T, а затем соединяет его в строку через символ @. Программу покажи учителю, он скажет код (если задание верно)."
}

answers = {
    1: "167",
    2: "1000",
    3: "994",
    4: "977",
    5: "38",
    6: "7626",
    7: "pididi"
}